import React, { useEffect } from "react";
import "./Return.scss";
import { Link } from "react-router-dom";
import { IoIosArrowForward } from "react-icons/io";

const Return = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <main>
      <section className="shopping-paymet">
        <div className="container">
          <div className="breadcumb">
            <Link to={"/"}>
              <p>Главная</p>
            </Link>
            <IoIosArrowForward />
            <p>Возврат</p>
          </div>
          <div className="shopping-paymet__cont">
            <div className="shopping-paymet__left">
              <h2 className="title">Возврат</h2>
            </div>
            <div className="shopping-paymet__right">
              <div>
                <h4>Обмен и возврат по желанию покупателя</h4>
                <p>
                  Если товар по каким-то причинам не подошел вам, вы имеете
                  право вернуть его или обменять на другой в течение 7 дней* с
                  момента покупки при соблюдении следующих условий:
                </p>
                <ul className="return__list">
                  <li>
                    Товар имеет первоначальный вид, имеется товарная кондиция;
                  </li>
                  <li>
                    Товар имеет полную комплектацию, включая упаковочные
                    материалы;
                  </li>
                  <li>
                    Товар не имеет следов подключался и не имеет признаков
                    монтажа;
                  </li>
                  <li>
                    Упаковка товара не имеет повреждений, присутствует
                    первоначальный товарный вид;
                  </li>
                  <li>
                    Есть документ, подтверждающий покупку в нашем
                    интернет-магазине.
                  </li>
                  <li>
                    Для возврата товара необходимо привезти его к нам в офис.
                  </li>
                  <li>
                    Товар из других городов можно прислать нам транспортной
                    компанией, при этом услуги транспортной
                    компании  оплачиваются клиентом.
                  </li>
                  <li>
                    *В течение 14 дней для отдельных брендов. При оформлении
                    заказа уточните у менеджера
                  </li>
                </ul>
              </div>
              <div>
                <h4>Обмен и возврат по ошибке продавца</h4>
                <p>Причины обмена или возврата по ошибке продавца:</p>
                <ul className="return__list">
                  <li>Неполная комплектация товара</li>
                  <li>Брак или дефект товара</li>
                  <li>
                    Если вы выявили дефект, брак или неполную комплектацию
                    товара, необходимо сделать фото дефекта и отправить на
                    почту mail@at-svet.ru, указав краткое описание характера
                    брака/
                  </li>
                  <li>
                    Мы заменим бракованный товар или довезем недостающие части.
                    Доставка будет осуществлена бесплатно
                  </li>
                </ul>
              </div>
              
              <div>
                <h4>Возврат денежных средств</h4>
                <p>
                  Возврат денежных средств осуществляется путем перевода <br />
                  на банковские реквизиты покупателя при наличии заявления{" "}
                  <br />
                  от покупателя.
                </p>
              </div>
            </div>
          </div>
        </div>
      </section>
    </main>
  );
};

export default Return;
